app/controllers/tasks_controller.rb

SELECT COUNT(*) FROM `tasks` JOIN taggings tasks_taggings_955b9d1 ON tasks_taggings_955b9d1.taggable_id = tasks.id AND tasks_taggings_955b9d1.taggable_type = 'Task' AND tasks_taggings_955b9d1.tag_id = 1
SELECT `tasks`.* FROM `tasks` JOIN taggings tasks_taggings_955b9d1 ON tasks_taggings_955b9d1.taggable_id = tasks.id AND tasks_taggings_955b9d1.taggable_type = 'Task' AND tasks_taggings_955b9d1.tag_id = 1 LIMIT 3 OFFSET 0
---
  def tag
    @tasks = Task.paginate(:per_page => 3, :page => params[:page])
                 .tagged_with(params[:id])

SELECT `tags`.* FROM `tags` WHERE (tags.name LIKE '%b%')
---
  def tags
    @tags = ActsAsTaggableOn::Tag.where("tags.name LIKE ?", "%#{params[:q]}%")

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 4 LIMIT 1
---
  def show
    @task = Task.find(params[:id])

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 5 LIMIT 1
---
  def edit
    @task = Task.find(params[:id])

INSERT INTO `tasks` (`answer`, `body_task`, `created_at`, `currect_answer_task`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `submit_task`, `title`, `updated_at`, `user_id`) VALUES ('bb', 'bb', '2012-09-10 06:06:04', NULL, NULL, NULL, NULL, NULL, NULL, 'bbqq', '2012-09-10 06:06:04', 3)
---
  def create
    @task = Task.new(params[:task])
    @task = current_user.tasks.build(params[:task])
    respond_to do |format|
      if @task.save

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 5 LIMIT 1
UPDATE `tasks` SET `image_file_name` = '1-intermediary-rails.jpg', `image_content_type` = 'image/jpeg', `image_file_size` = 44090, `image_updated_at` = '2012-09-10 08:40:36', `updated_at` = '2012-09-10 08:40:37' WHERE `tasks`.`id` = 7
---
  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])

INSERT INTO `statistics` (`created_at`, `currect_answer`, `task_id`, `updated_at`, `user_id`) VALUES ('2012-09-10 07:14:14', 1, '1', '2012-09-10 07:14:14', NULL)
UPDATE `users` SET `counter` = 1, `updated_at` = '2012-09-10 08:33:05' WHERE `users`.`id` = 5
---
    task = Task.where(:id => params[:id],
                      :answer => params[:answer])
    if task.empty?
      flash[:notice] = "Wrong answer"
      redirect_to task_path
    else
      statistic = Statistic.create(:task_id => params[:id],
                                   :user_id => current_user.id, #User.find_by_id(session[:current_user_id]),
                                   :currect_answer => true)
      current_user.counter += 1
      current_user.save!